{"format": "layers-model", "generatedBy": "keras v2.4.0", "convertedBy": "TensorFlow.js Converter v2.0.1.post1", "modelTopology": {"keras_version": "2.4.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "functional_3", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 5], "dtype": "float32", "sparse": false, "ragged": false, "name": "home_bag_of_players"}, "name": "home_bag_of_players", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 5], "dtype": "float32", "sparse": false, "ragged": false, "name": "away_bag_of_players"}, "name": "away_bag_of_players", "inbound_nodes": []}, {"class_name": "Embedding", "config": {"name": "embedding_2", "trainable": true, "batch_input_shape": [null, 5], "dtype": "float32", "input_dim": 1246, "output_dim": 16, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 5}, "name": "embedding_2", "inbound_nodes": [[["home_bag_of_players", 0, 0, {}]]]}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 232], "dtype": "float32", "sparse": false, "ragged": false, "name": "home_stats"}, "name": "home_stats", "inbound_nodes": []}, {"class_name": "Embedding", "config": {"name": "embedding_3", "trainable": true, "batch_input_shape": [null, 5], "dtype": "float32", "input_dim": 1246, "output_dim": 16, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 5}, "name": "embedding_3", "inbound_nodes": [[["away_bag_of_players", 0, 0, {}]]]}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 232], "dtype": "float32", "sparse": false, "ragged": false, "name": "away_stats"}, "name": "away_stats", "inbound_nodes": []}, {"class_name": "Flatten", "config": {"name": "flatten_2", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "flatten_2", "inbound_nodes": [[["embedding_2", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_for_home_stats", "trainable": true, "dtype": "float32", "units": 155, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 0.009999999776482582}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_for_home_stats", "inbound_nodes": [[["home_stats", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "flatten_3", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "flatten_3", "inbound_nodes": [[["embedding_3", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_for_away_stats", "trainable": true, "dtype": "float32", "units": 155, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 0.009999999776482582}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_for_away_stats", "inbound_nodes": [[["away_stats", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_hm_bop", "trainable": true, "dtype": "float32", "rate": 0.3, "noise_shape": null, "seed": null}, "name": "dropout_hm_bop", "inbound_nodes": [[["flatten_2", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_4", "trainable": true, "dtype": "float32", "alpha": 0.05000000074505806}, "name": "leaky_re_lu_4", "inbound_nodes": [[["dense_for_home_stats", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_aw_bop", "trainable": true, "dtype": "float32", "rate": 0.3, "noise_shape": null, "seed": null}, "name": "dropout_aw_bop", "inbound_nodes": [[["flatten_3", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_6", "trainable": true, "dtype": "float32", "alpha": 0.05000000074505806}, "name": "leaky_re_lu_6", "inbound_nodes": [[["dense_for_away_stats", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "home_merged", "trainable": true, "dtype": "float32", "axis": 1}, "name": "home_merged", "inbound_nodes": [[["dropout_hm_bop", 0, 0, {}], ["leaky_re_lu_4", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "away_merged", "trainable": true, "dtype": "float32", "axis": 1}, "name": "away_merged", "inbound_nodes": [[["dropout_aw_bop", 0, 0, {}], ["leaky_re_lu_6", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_hm_merged", "trainable": true, "dtype": "float32", "rate": 0.3, "noise_shape": null, "seed": null}, "name": "dropout_hm_merged", "inbound_nodes": [[["home_merged", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_aw_merged", "trainable": true, "dtype": "float32", "rate": 0.3, "noise_shape": null, "seed": null}, "name": "dropout_aw_merged", "inbound_nodes": [[["away_merged", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_all_home", "trainable": true, "dtype": "float32", "units": 13, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 0.009999999776482582}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_all_home", "inbound_nodes": [[["dropout_hm_merged", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_all_away", "trainable": true, "dtype": "float32", "units": 13, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 0.009999999776482582}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_all_away", "inbound_nodes": [[["dropout_aw_merged", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_5", "trainable": true, "dtype": "float32", "alpha": 0.05000000074505806}, "name": "leaky_re_lu_5", "inbound_nodes": [[["dense_all_home", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_7", "trainable": true, "dtype": "float32", "alpha": 0.05000000074505806}, "name": "leaky_re_lu_7", "inbound_nodes": [[["dense_all_away", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "all_merged", "trainable": true, "dtype": "float32", "axis": 1}, "name": "all_merged", "inbound_nodes": [[["leaky_re_lu_5", 0, 0, {}], ["leaky_re_lu_7", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "output", "trainable": true, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "output", "inbound_nodes": [[["all_merged", 0, 0, {}]]]}], "input_layers": [["home_stats", 0, 0], ["home_bag_of_players", 0, 0], ["away_stats", 0, 0], ["away_bag_of_players", 0, 0]], "output_layers": [["output", 0, 0]]}}, "training_config": {"loss": "binary_crossentropy", "metrics": ["accuracy"], "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "Adam", "config": {"name": "Adam", "learning_rate": 0.0010000000474974513, "decay": 0.0, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "dense_all_away/kernel", "shape": [235, 13], "dtype": "float32"}, {"name": "dense_all_away/bias", "shape": [13], "dtype": "float32"}, {"name": "dense_all_home/kernel", "shape": [235, 13], "dtype": "float32"}, {"name": "dense_all_home/bias", "shape": [13], "dtype": "float32"}, {"name": "dense_for_away_stats/kernel", "shape": [232, 155], "dtype": "float32"}, {"name": "dense_for_away_stats/bias", "shape": [155], "dtype": "float32"}, {"name": "dense_for_home_stats/kernel", "shape": [232, 155], "dtype": "float32"}, {"name": "dense_for_home_stats/bias", "shape": [155], "dtype": "float32"}, {"name": "embedding_2/embeddings", "shape": [1246, 16], "dtype": "float32"}, {"name": "embedding_3/embeddings", "shape": [1246, 16], "dtype": "float32"}, {"name": "output/kernel", "shape": [26, 1], "dtype": "float32"}, {"name": "output/bias", "shape": [1], "dtype": "float32"}]}]}